## pd05. 새로운 컬럼 추가

In [26]:
import pandas as pd

df = pd.read_csv('data/cafe.csv')
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

### 1. 새로운 컬럼 추가

In [27]:
df['new'] = 0
df.head(2)

      메뉴    가격  칼로리  new
0  아메리카노  4500   10    0
1   카페라떼  5000  110    0

### 2. 기존 컬럼을 사용한 계산

In [28]:
discount = 0.2
df['할인가']=df['가격']*(1-discount)
df.head(2)

      메뉴    가격  칼로리  new     할인가
0  아메리카노  4500   10    0  3600.0
1   카페라떼  5000  110    0  4000.0

## pd06. 데이터 삭제

In [29]:
df=pd.read_csv('data/cafe.csv')
df.head(3)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250

### 1. 행 삭제
inplace = True : 결과값 저장

In [30]:
df.drop(1,axis=0,inplace=True)
df.head(3)

      메뉴    가격  칼로리
0  아메리카노  4500   10
2   카페모카  5500  250
3   카푸치노  5000  110

### 2. 컬럼(열 삭제)

In [31]:
df=df.drop('칼로리', axis=1)
df.head(3)

      메뉴    가격
0  아메리카노  4500
2   카페모카  5500
3   카푸치노  5000

In [32]:
# 삭제 전후의 데이터 크기 확인

print(df.shape)    # 삭제 전
df.drop(2, axis=0, inplace=True)
df.shape    # 삭제 후

(6, 2)

(5, 2)